src/cf/Catalogs/инт_ПодписчикиJRPC.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПодписчикиJRPC</Name>
			<Comment>Подписчики для отправки по JSON-RPC 2.0</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эндпоинт</Name>
					<Comment>HTTP-сервер JSON-RPC</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Эндпоинты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПостПроцессинг</Name>
					<Comment>Обработчики по кодам HTTP-ответа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСостояния</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Comment>BSL-код обработчика</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/инт_ПодписчикиJRPC/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// инт_ПодписчикиJRPC.ФормаЭлемента
// Форма подписчика JSON-RPC 2.0
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
// Инициализация
КонецПроцедуры



#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыПостПроцессинг

&НаКлиенте
Процедура ПостПроцессингОбработчикНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

СтандартнаяОбработка = Ложь;
ДопПараметры = Новый Структура("ТекстОбработчика", Элемент.ТекстРедактирования);
ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияРедактированияОбработчика", ЭтотОбъект);

ОткрытьФорму("ОбщаяФорма.инт_РедакторОбработчика",
ДопПараметры,
Элемент,
,
,
,
ОписаниеОповещения,
РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияРедактированияОбработчика(ТекстОбработчика, ДополнительныеПараметры) Экспорт

Если ТекстОбработчика = Неопределено Тогда
Возврат;
КонецЕсли;

Элементы.ПостПроцессинг.ТекущиеДанные.Обработчик = ТекстОбработчика;
Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТестПодключения(Команда)

Если НЕ ЗначениеЗаполнено(Объект.Эндпоинт) Тогда
ПоказатьПредупреждение(, "Не указан эндпоинт!");
Возврат;
КонецЕсли;

Результат = ВыполнитьТестПодключенияНаСервере();

Если Результат.Успех Тогда
ТекстСообщения = СтрШаблон("Подключение успешно!
|
|Код ответа: %1", Результат.КодСостояния);
ПоказатьПредупреждение(, ТекстСообщения);
Иначе
ПоказатьПредупреждение(, "Ошибка подключения: " + Результат.ОписаниеОшибки);
КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьТестПодключенияНаСервере()

Результат = Новый Структура("Успех, ОписаниеОшибки, КодСостояния", Ложь, "", 0);

Попытка
АдресРесурса = инт_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Эндпоинт, "АдресРесурса");
Если НЕ ЗначениеЗаполнено(АдресРесурса) Тогда
Результат.ОписаниеОшибки = "Не указан адрес ресурса в эндпоинте";
Возврат Результат;
КонецЕсли;

// Формируем тестовый JSON-RPC запрос
ТестовыйЗапрос = Новый Структура;
ТестовыйЗапрос.Вставить("jsonrpc", "2.0");
ТестовыйЗапрос.Вставить("method", "ping");
ТестовыйЗапрос.Вставить("params", Новый Структура);
ТестовыйЗапрос.Вставить("id", "test-connection");

Заголовки = Новый Соответствие;
Заголовки.Вставить("Content-Type", "application/json");

Ответ = инт_КоннекторHTTP.Post(АдресРесурса, инт_КоннекторHTTP.ОбъектВJson(ТестовыйЗапрос), Заголовки);
Результат.Успех = (Ответ.КодСостояния >= 200 И Ответ.КодСостояния < 500);
Результат.КодСостояния = Ответ.КодСостояния;
Исключение
Результат.ОписаниеОшибки = ОписаниеОшибки();
КонецПопытки;

Возврат Результат;

КонецФункции

#КонецОбласти
